---
kind: method
id: M:Autodesk.Revit.DB.ElementArrayIterator.#ctor
source: html/5d13ec14-d18f-cceb-b56e-955b7d59f9b5.htm
---
# Autodesk.Revit.DB.ElementArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ElementArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.